dynsite-org/dynsite-help.org
#+TITLE: DynSite: Dynamic Org 2 HTML Project definition

This is a guide to using the dynamic org-to-html publishing project definition scheme called DynSite. 

DynSite is an extension of the default project publishing scheme of orgmode. Instead of writing project definitions in emacs-lisp as is done in the original orgmode publishing scheme, the present extension allows one to define and customize the projects by putting them in folders and to define their custom parameters in plain text, using orgmode markup.


* Overview: Features of the dynsite package

** Minimal setup effort
The dynsite package builds on the standard org-publish scheme. It provides functions which simplify the definition of groups of projects. Instead of defining projects in emacs-lisp by creating lists of settings for folders and properties, one defines for each site one source folder and one target folder only.  Any number of projects or subprojects can be defined inside a source folder.  Dynsite scans all folders of a site, and creates projects for those folders which contain a file config.org, naming each project after the name of the folder that contains it. Projects in subfolders inherit the configuration parameters of their superfolder-projects. 

** Dynamic completion of relative paths in subfolders
An important feature is the automatic completion of relative paths of links, which keeps the links to css or other files consistent even in subfolders of a project. For example: 

If the path to a css file, which is used for headers defining the page style of a all files in a site, is =./css/org.css=, then normally a file which is placed in a subfolder of the projects' top folder must change the path of the css style link to =./../css/org.css=.   Org-mode > 8.0 provides a mechanism for doing this simpler described in the doc (http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html) in paragraph /"Tired of export templates?"/. Dynsite provides a scheme that is simpler than that.  In order to make any link update to a relative path to the root folder, one codes the "root folder" of the project with the string ={{.}}==. So instead of defining the style path in =html-head=extra= as:

: <link rel="stylesheet" href="./css/org.css" type="text/css"/>

one defines it as: 

: <link rel="stylesheet" href="{{.}}/css/org.css" type="text/css"/>

Dynsite adds a filter to =org-export-filter-final-output-functions= which converts the string ={{.}}= to a relative path consitently pointing to the original css file.  The same holds for all other links inside the org files to be published. 

* Orgmode publishing and DynSite working principles

The html publishing scheme of orgmode allows one to define groups of files which share the same configuration (headers, footers, css style files etc.), so that these files are puglished together with one command.  Such a group of files is called a project.  It is possible to define many projects.  One can publish a project with the command org-publish-project.  To define a project in orgmode one has to code its specifications in emacs-lisp.  Coding this is cumbersome, especially because any html strings that will be included in the files as headers, footers etc. must be coded as lisp-strings, which requires double-escaping html characters such as tag delimiters and other elements.  The present tool, DynSite, makes the project definition process easier by letting one define a projects parameters in a config file written in org mode.  It simplifies the specification of projects  further by grouping these in subfolders of one folder.  A group of projects contained under one folder is called a /site/.  In DynSite, one defines one site by specifying the following three elements: 

1. Site source folder: The location of the folder which contains the project subfolders. 
2. Site target folder: The folder where these projects should be published as html.
3. The method for uploading the published html files to the server. 

The folder structure of the published files inide the site target folder is the same as the folder structure of the site source. 

To define a project inside the Site source folder one creates a file named config.org in it. This file contains the configuration of the project, i.e. web page name, headers, footers, style etc.  One can put a config.org file in any subfolder of the site, including a subfolder of a folder that already contains a project.  Project characteristics are inherited.  Projects are named after the name of the folder which contains them.  For example, consider a site source folder named "mysite", containing the following folders and files: 

#+BEGIN_EXAMPLE
mysite
   config.org
   index.org
   ...
   proj1/
      config.org
      proj1page1.org
      ...
   proj2/
      config.org
      proj2.org
      ...
      subproj1/
          config.org
          subproj1.org
          ...
#+END_EXAMPLE

The above folders and files define the projects =mysite=, =proj1=, =proj2= and =subproj1=. =subproj1= inherits its specifications from =proj2=. =proj1= and =proj2= inherit their style specifications from project =mysite=.  DynSite provides commands for publishing all projects of a site, or a selected project by name. 

One can define any number of sites in DynSite. But only one site is current at any time. One chooses the current site by its name with the command org-choose-site. 

* Quick setup

@<b>For a summary of all commands and quick configuration guide for setting up a site see [[./dynsite-command-reference.org][here]].@</b>

