dynsite-help.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>DynSite: Dynamic Org 2 HTML Project definition</title>
<!-- 2013-10-13 Sun 20:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="Ioannis Zannos"/>

<link rel="stylesheet" href="./css/org.css" type="text/css"/>
</head>
<body>
<div id="content">
<h1 class="title">DynSite: Dynamic Org 2 HTML Project definition</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Overview: Features of the dynsite package</a>
<ul>
<li><a href="#sec-1-1">Minimal setup effort</a></li>
<li><a href="#sec-1-2">Dynamic completion of relative paths in subfolders</a></li>
</ul>
</li>
<li><a href="#sec-2">Orgmode publishing and DynSite working principles</a></li>
<li><a href="#sec-3">Quick setup</a></li>
<li><a href="#sec-4">Defining a site</a></li>
<li><a href="#sec-5">Site File Structure</a>
<ul>
<li><a href="#sec-5-1">Source and Target Folders</a></li>
<li><a href="#sec-5-2">Project Definition</a></li>
</ul>
</li>
<li><a href="#sec-6">The Project List</a>
<ul>
<li><a href="#sec-6-1">Project inheritance</a></li>
<li><a href="#sec-6-2">Org and static projects</a></li>
</ul>
</li>
<li><a href="#sec-7">Installing a Site</a></li>
<li><a href="#sec-8">Publish+Upload a Site</a></li>
<li><a href="#sec-9">Working with multiple sites</a>
<ul>
<li><a href="#sec-9-1">Adding a site</a></li>
<li><a href="#sec-9-2">Choosing one site to work with, from the list of known sites</a></li>
</ul>
</li>
<li><a href="#sec-10">Generate projects</a></li>
<li><a href="#sec-11">Publish selected project</a></li>
<li><a href="#sec-12">Utilities</a>
<ul>
<li><a href="#sec-12-1">Add project files to refile targets</a></li>
<li><a href="#sec-12-2">Force export of all files</a></li>
<li><a href="#sec-12-3">Dired site directory</a></li>
<li><a href="#sec-12-4">Edit configuration files</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This is a guide to using the dynamic org-to-html publishing project definition scheme called DynSite. 
</p>

<p>
DynSite is an extension of the default project publishing scheme of orgmode. Instead of writing project definitions in emacs-lisp as is done in the original orgmode publishing scheme, the present extension allows one to define and customize the projects by putting them in folders and to define their custom parameters in plain text, using orgmode markup.
</p>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Overview: Features of the dynsite package</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Minimal setup effort</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The dynsite package builds on the standard org-publish scheme. It provides functions which simplify the definition of groups of projects. Instead of defining projects in emacs-lisp by creating lists of settings for folders and properties, one defines for each site one source folder and one target folder only.  Any number of projects or subprojects can be defined inside a source folder.  Dynsite scans all folders of a site, and creates projects for those folders which contain a file config.org, naming each project after the name of the folder that contains it. Projects in subfolders inherit the configuration parameters of their superfolder-projects. 
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Dynamic completion of relative paths in subfolders</h3>
<div class="outline-text-3" id="text-1-2">
<p>
An important feature is the automatic completion of relative paths of links, which keeps the links to css or other files consistent even in subfolders of a project. For example: 
</p>

<p>
If the path to a css file, which is used for headers defining the page style of a all files in a site, is <code>./css/org.css</code>, then normally a file which is placed in a subfolder of the projects' top folder must change the path of the css style link to <code>./../css/org.css</code>.   Org-mode &gt; 8.0 provides a mechanism for doing this simpler described in the doc (<a href="http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html</a>) in paragraph /"Tired of export templates?"/. Dynsite provides a scheme that is simpler than that.  In order to make any link update to a relative path to the root folder, one codes the "root folder" of the project with the string <code>{{.}}</code>. So instead of defining the style path in <code>html-head</code> as:
</p>

<pre class="example">
&lt;link rel="stylesheet" href="./css/org.css" type="text/css"/&gt;
</pre>

<p>
one defines it as: 
</p>

<pre class="example">
&lt;link rel="stylesheet" href="{{.}}/css/org.css" type="text/css"/&gt;
</pre>

<p>
Dynsite adds a filter to <code>org-export-filter-final-output-functions</code> which converts the string <code>.</code> to a relative path consitently pointing to the original css file.  The same holds for all other links inside the org files to be published. 
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Orgmode publishing and DynSite working principles</h2>
<div class="outline-text-2" id="text-2">
<p>
The html publishing scheme of orgmode allows one to define groups of files which share the same configuration (headers, footers, css style files etc.), so that these files are puglished together with one command.  Such a group of files is called a project.  It is possible to define many projects.  One can publish a project with the command org-publish-project.  To define a project in orgmode one has to code its specifications in emacs-lisp.  Coding this is cumbersome, especially because any html strings that will be included in the files as headers, footers etc. must be coded as lisp-strings, which requires double-escaping html characters such as tag delimiters and other elements.  The present tool, DynSite, makes the project definition process easier by letting one define a projects parameters in a config file written in org mode.  It simplifies the specification of projects  further by grouping these in subfolders of one folder.  A group of projects contained under one folder is called a <i>site</i>.  In DynSite, one defines one site by specifying the following three elements: 
</p>

<ol class="org-ol">
<li>Site source folder: The location of the folder which contains the project subfolders. 
</li>
<li>Site target folder: The folder where these projects should be published as html.
</li>
<li>The method for uploading the published html files to the server. 
</li>
</ol>

<p>
The folder structure of the published files inide the site target folder is the same as the folder structure of the site source. 
</p>

<p>
To define a project inside the Site source folder one creates a file named config.org in it. This file contains the configuration of the project, i.e. web page name, headers, footers, style etc.  One can put a config.org file in any subfolder of the site, including a subfolder of a folder that already contains a project.  Project characteristics are inherited.  Projects are named after the name of the folder which contains them.  For example, consider a site source folder named "mysite", containing the following folders and files: 
</p>

<pre class="example">
mysite
   config.org
   index.org
   ...
   proj1/
      config.org
      proj1page1.org
      ...
   proj2/
      config.org
      proj2.org
      ...
      subproj1/
          config.org
          subproj1.org
          ...
</pre>

<p>
The above folders and files define the projects <code>mysite</code>, <code>proj1</code>, <code>proj2</code> and <code>subproj1</code>. <code>subproj1</code> inherits its specifications from <code>proj2</code>. <code>proj1</code> and <code>proj2</code> inherit their style specifications from project <code>mysite</code>.  DynSite provides commands for publishing all projects of a site, or a selected project by name. 
</p>

<p>
One can define any number of sites in DynSite. But only one site is current at any time. One chooses the current site by its name with the command org-choose-site. 
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Quick setup</h2>
<div class="outline-text-2" id="text-3">
<p>
@&lt;b&gt;For a summary of all commands and quick configuration guide for setting up a site see <a href="./dynsite-command-reference.html">here</a>.@&lt;/b&gt;
</p>
</div>
</div>
