dynsite-org/dynsite-help.org
* Defining a site

Here is the definition of a site which takes its source files (org) from =~/SitesSource/= and publishes the result in =~/Sites/=. (Note: =~/Sites/= is the default folder for a user's personal home page files in MacOS X). 

#+BEGIN_EXAMPLE
(org-install-site 
     '(
;; name of your site: 
	"my-site" 
;; path of the folder containing the all org project files:
	"~/SitesSource" 
;; path of the folder where the html files will be published:
	"~/Sites" 
;; this string will be used as address to upload files to web with rsync:
	"earlabor@earlab.org:public_html/larigot-tests/"
))
#+END_EXAMPLE

In MacOS X one can browse the resulting site by accessing it via the =file= protocol: file:///Users/username/Sites/index.html or, if Apache is running on the local computer, with: http://localhost/~username/ .


* Site File Structure

** Source and Target Folders

For each site defned with DynSite expects all org-to-html projects to be stored as subfolders of one single folder. For example, if one has 3 projects named project1, project2 and project3, one could place them in one folder named org as follows: 

|-----------------------------------+-------------------------------------|
| path                              | contents                            |
|-----------------------------------+-------------------------------------|
| /users/user1/websites/org         | top folder containing all projects  |
| /users/user1/website/org/project1 | all files (and folders) of project1 |
| /users/user1/website/org/project2 | all files (and folders) of project2 |
| /users/user1/website/org/project2 | all files (and folders) of project3 |
|-----------------------------------+-------------------------------------|

These projects are published in subfolders of the single target folder specified in the site definition, preserving the same structure as the source folder. 

It is possible to work with several different sites, where each site has its own source folder (the org project files), its own target folder (the published html files) and a url for uploading the rendered html files to a server using rsync. See [[Working with multiple sites]] below. 

