dynsite-help.html
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Defining a site</h2>
<div class="outline-text-2" id="text-4">
<p>
Here is the definition of a site which takes its source files (org) from <code>~/SitesSource/</code> and publishes the result in <code>~/Sites/</code>. (Note: <code>~/Sites/</code> is the default folder for a user's personal home page files in MacOS X). 
</p>

<pre class="example">
(org-install-site 
     '(
;; name of your site: 
	"my-site" 
;; path of the folder containing the all org project files:
	"~/SitesSource" 
;; path of the folder where the html files will be published:
	"~/Sites" 
;; this string will be used as address to upload files to web with rsync:
	"earlabor@earlab.org:public_html/larigot-tests/"
))
</pre>

<p>
In MacOS X one can browse the resulting site by accessing it via the <code>file</code> protocol: <a href="file:////Users/username/Sites/index.html">file:////Users/username/Sites/index.html</a> or, if Apache is running on the local computer, with: <a href="http://localhost/~username/">http://localhost/~username/</a> .
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Site File Structure</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Source and Target Folders</h3>
<div class="outline-text-3" id="text-5-1">
<p>
For each site defned with DynSite expects all org-to-html projects to be stored as subfolders of one single folder. For example, if one has 3 projects named project1, project2 and project3, one could place them in one folder named org as follows: 
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>
</colgroup>
<thead>
<tr>
<th scope="col" class="left">path</th>
<th scope="col" class="left">contents</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">/users/user1/websites/org</td>
<td class="left">top folder containing all projects</td>
</tr>

<tr>
<td class="left">/users/user1/website/org/project1</td>
<td class="left">all files (and folders) of project1</td>
</tr>

<tr>
<td class="left">/users/user1/website/org/project2</td>
<td class="left">all files (and folders) of project2</td>
</tr>

<tr>
<td class="left">/users/user1/website/org/project2</td>
<td class="left">all files (and folders) of project3</td>
</tr>
</tbody>
</table>

<p>
These projects are published in subfolders of the single target folder specified in the site definition, preserving the same structure as the source folder. 
</p>

<p>
It is possible to work with several different sites, where each site has its own source folder (the org project files), its own target folder (the published html files) and a url for uploading the rendered html files to a server using rsync. See <a href="#sec-9">Working with multiple sites</a> below. 
</p>
</div>
</div>
