dynsite-org/dynsite-help.org
** Project Definition

There is only one rule for defining a project: 

*If* a folder is contained in the top folder containing all projects *and* this folder contains a file called /config.org/ *then* this folder becomes a project folder. 

This means: To define a new project for publishing, you must do 2 things: 

1. Create a folder for the project, which is contained inside the top folder holding all projects, or one of its subfolders
2. Create a file called config.org inside the top level of the folder that contains the project. 

The contents of the file config.org define the properties of the project, i.e. they customize the project. In orgmode, the publishing options of a project are defined as (emacs-lisp) properties. These are described in section "13.1.5 Options for the HTML/LaTeX exporters" of the org-info documentation (type "meta-x org-info" to enter the org-info documentation, then go to section (menu item) Publishing, subsection Configuration, subsubsection "Publishing options"). The config.org file lets one define these properties in a simpler way, without writing them as lisp expressions.  This is done as follows: 

A property consists of a name (the name of the property) and a value (the value of the property). In the config.org file, the name of the property is given as a top-level org-node entry and the value of the property is given as the contents of the entry. For example, to define the property "author" giving it the value "Tom Jones", one puts the following node in the config.org file: 

#+BEGIN_EXAMPLE
,* author
Tom Jones
#+END_EXAMPLE

A special case are properties whose values are not strings (such as the string "Tom Jones" above), but lisp objects such as numbers, functions or other types of objects. These are indicated in the config.org file by appending ":" to the name of the property, and are entered as expressions that are evaluated by lisp, in the same line as the property name. For example, 
If a property needs to have a numerical value, or an otherwise computed value, this value is written as an expression that can be evaluated by lisp, in a single line. For example, to set the property "section-numbers" to the value "nil", one writes: 

#+BEGIN_EXAMPLE
,* section-numbers: nil
#+END_EXAMPLE

Second example: To set the property "headline-levels" to 3, one writes: 

#+BEGIN_EXAMPLE
,* headline-levels: 3
#+END_EXAMPLE

Following example compares the configuration of a project using lisp source code with the same configuration done using config.org in DynSite. 

#+BEGIN_EXAMPLE
;; Webtools project. Configuration using the original emacs-lisp code method of orgmode: 
(add-to-list 'org-publish-project-alist
	'("webtools"
	 :base-directory "~/Dropbox/orgshared/sites/org/earlab/tools/webtools/"
	 :base-extension "org"
	 :publishing-directory "~/Dropbox/orgshared/sites/html/earlab/tools/webtools/"
	 :section-numbers nil
	 :table-of-contents nil
	 :recursive t
	 :publishing-function org-publish-org-to-html
	 :headline-levels 1        
	 :auto-preamble t
	 :preamble 
	 "
<div id=\"toc\">
<a href=\"http://earlab.org/\">Earlab Home</a> | 
<a href=\"http://earlab.org/tools/webtools\">Web Tools Home</a> | 
<a href=\"http://earlab.org/tools/webtools/gettingstart.html\">Getting Started</a> | 
<a href=\"http://earlab.org/tools/webtools/javascript.html\">JavaScript</a> | 
<a href=\"http://earlab.org/tools/webtools/projects.html\">Projects</a> | 
<a href=\"http://earlab.org/tools/webtools/tutorials.html\">Tutorials</a> | 
<a href=\"http://earlab.org/tools/webtools/topics.html\">Topics</a> | 
<a href=\"http://earlab.org/tools/webtools/links.html\">Links</a> |  
</div> 

<div style = \"position: absolute; top: 10px; left: 10px; \">
 <FORM METHOD=\"POST\" ACTION=\"/tools/webtools/cgi-bin/3.0/search_engine.cgi\"><INPUT TYPE=\"text\" SIZE=\"20\" NAME=\"keywords\" MAXLENGTH=\"80\"><INPUT TYPE=\"SUBMIT\" VALUE=\"Search\"></FORM> 
</div>

"
	 :style "
<link rel=\"stylesheet\" href=\"http://ambiant.earlab.org/css/org.css\" type=\"text/css\"/>
"
	 :auto-index t
	 :table-of-contents t
	 :author "Ioannis Zannos & Aris Bezas"
	 :email  "zannos AT gmail DOT com  & aribezas AT gmail DOT com"
)
	)

;; Copy files from tool to ambiant workshop2011
(add-to-list 'org-publish-project-alist
	'("copy-webtools-files"
	 :base-directory "~/Dropbox/orgshared/sites/org/earlab/tools/webtools/"
	 :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|zip"
	 :publishing-directory "~/Dropbox/orgshared/sites/html/earlab/tools/webtools/"
	 :recursive t
	 :publishing-function org-publish-attachment
	 )

       )
#+END_EXAMPLE

To define the same project using DynSite one writes the following text in the config.org file which is contained in the folder that holds the org files of he project: 

#+BEGIN_EXAMPLE
,* section-numbers: nil
,* table-of-contents: nil
,* recursive: t
,* headline-levels: 1
,* auto-preamble: t
,* preamble
<div id="toc">
<a href="http://earlab.org/">Earlab Home</a> | 
<a href="http://earlab.org/tools/webtools">Web Tools Home</a> | 
<a href="http://earlab.org/tools/webtools/gettingstart.html">Getting Started</a> | 
<a href="http://earlab.org/tools/webtools/javascript.html">JavaScript</a> | 
<a href="http://earlab.org/tools/webtools/projects.html">Projects</a> | 
<a href="http://earlab.org/tools/webtools/tutorials.html">Tutorials</a> | 
<a href="http://earlab.org/tools/webtools/topics.html">Topics</a> | 
<a href="http://earlab.org/tools/webtools/links.html">Links</a> | 
</div>
,* style
<link rel="stylesheet" href="./css/org.css" type="text/css"/>
,* auto-index: t
,* table-of-contents: t
,* author: "Ioannis Zannos & Aris Bezas"
,* email:  "zannos AT gmail DOT com  & aribezas AT gmail DOT com"
#+END_EXAMPLE

Note that the definition of the project is much shorter in config.org, because many items are automatically provided by DynSite based on the location and name of the folder which contains the project: 
- The name of the project is provided by the name of the folder that contains the config.org and the org content files.
- The base directory is inferred automatically.
- The publishing directory is inferred automatically.
- The publishing function is provided automatically
- The project for publishing configuration and media files (css, png, mp3, etc) is created automatically

You can add a site to the list of sites as follows (but this will not make it current):
#+BEGIN_EXAMPLE:
(add-to-list 'org-sites org-current-site '(<site name> <org path> <html path> <upload url>))
#+END_EXAMPLE:

Example: 
#+BEGIN_EXAMPLE:
(add-to-list 'org-sites
      '(
	"larigot-earlab" 
	"~/Dropbox/orgshared/sites/org/larigot-tests" 
	"~/Dropbox/orgshared/sites/html/larigot-tests" 
	"earlabor@earlab.org:public_html/larigot-tests/"))
#+END_EXAMPLE:

To add a site and make it current use the function org-install-site as described in the next section. 


* The Project List

