dynsite-help.html
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">Project Definition</h3>
<div class="outline-text-3" id="text-5-2">
<p>
There is only one rule for defining a project: 
</p>

<p>
<b>If</b> a folder is contained in the top folder containing all projects <b>and</b> this folder contains a file called <i>config.org</i> <b>then</b> this folder becomes a project folder. 
</p>

<p>
This means: To define a new project for publishing, you must do 2 things: 
</p>

<ol class="org-ol">
<li>Create a folder for the project, which is contained inside the top folder holding all projects, or one of its subfolders
</li>
<li>Create a file called config.org inside the top level of the folder that contains the project. 
</li>
</ol>

<p>
The contents of the file config.org define the properties of the project, i.e. they customize the project. In orgmode, the publishing options of a project are defined as (emacs-lisp) properties. These are described in section "13.1.5 Options for the HTML/LaTeX exporters" of the org-info documentation (type "meta-x org-info" to enter the org-info documentation, then go to section (menu item) Publishing, subsection Configuration, subsubsection "Publishing options"). The config.org file lets one define these properties in a simpler way, without writing them as lisp expressions.  This is done as follows: 
</p>

<p>
A property consists of a name (the name of the property) and a value (the value of the property). In the config.org file, the name of the property is given as a top-level org-node entry and the value of the property is given as the contents of the entry. For example, to define the property "author" giving it the value "Tom Jones", one puts the following node in the config.org file: 
</p>

<pre class="example">
* author
Tom Jones
</pre>

<p>
A special case are properties whose values are not strings (such as the string "Tom Jones" above), but lisp objects such as numbers, functions or other types of objects. These are indicated in the config.org file by appending ":" to the name of the property, and are entered as expressions that are evaluated by lisp, in the same line as the property name. For example, 
If a property needs to have a numerical value, or an otherwise computed value, this value is written as an expression that can be evaluated by lisp, in a single line. For example, to set the property "section-numbers" to the value "nil", one writes: 
</p>

<pre class="example">
* section-numbers: nil
</pre>

<p>
Second example: To set the property "headline-levels" to 3, one writes: 
</p>

<pre class="example">
* headline-levels: 3
</pre>

<p>
Following example compares the configuration of a project using lisp source code with the same configuration done using config.org in DynSite. 
</p>

<pre class="example">
;; Webtools project. Configuration using the original emacs-lisp code method of orgmode: 
(add-to-list 'org-publish-project-alist
	'("webtools"
	 :base-directory "~/Dropbox/orgshared/sites/org/earlab/tools/webtools/"
	 :base-extension "org"
	 :publishing-directory "~/Dropbox/orgshared/sites/html/earlab/tools/webtools/"
	 :section-numbers nil
	 :table-of-contents nil
	 :recursive t
	 :publishing-function org-publish-org-to-html
	 :headline-levels 1        
	 :auto-preamble t
	 :preamble 
	 "
&lt;div id=\"toc\"&gt;
&lt;a href=\"http://earlab.org/\"&gt;Earlab Home&lt;/a&gt; | 
&lt;a href=\"http://earlab.org/tools/webtools\"&gt;Web Tools Home&lt;/a&gt; | 
&lt;a href=\"http://earlab.org/tools/webtools/gettingstart.html\"&gt;Getting Started&lt;/a&gt; | 
&lt;a href=\"http://earlab.org/tools/webtools/javascript.html\"&gt;JavaScript&lt;/a&gt; | 
&lt;a href=\"http://earlab.org/tools/webtools/projects.html\"&gt;Projects&lt;/a&gt; | 
&lt;a href=\"http://earlab.org/tools/webtools/tutorials.html\"&gt;Tutorials&lt;/a&gt; | 
&lt;a href=\"http://earlab.org/tools/webtools/topics.html\"&gt;Topics&lt;/a&gt; | 
&lt;a href=\"http://earlab.org/tools/webtools/links.html\"&gt;Links&lt;/a&gt; |  
&lt;/div&gt; 

&lt;div style = \"position: absolute; top: 10px; left: 10px; \"&gt;
 &lt;FORM METHOD=\"POST\" ACTION=\"/tools/webtools/cgi-bin/3.0/search_engine.cgi\"&gt;&lt;INPUT TYPE=\"text\" SIZE=\"20\" NAME=\"keywords\" MAXLENGTH=\"80\"&gt;&lt;INPUT TYPE=\"SUBMIT\" VALUE=\"Search\"&gt;&lt;/FORM&gt; 
&lt;/div&gt;

"
	 :style "
&lt;link rel=\"stylesheet\" href=\"http://ambiant.earlab.org/css/org.css\" type=\"text/css\"/&gt;
"
	 :auto-index t
	 :table-of-contents t
	 :author "Ioannis Zannos &amp; Aris Bezas"
	 :email  "zannos AT gmail DOT com  &amp; aribezas AT gmail DOT com"
)
	)

;; Copy files from tool to ambiant workshop2011
(add-to-list 'org-publish-project-alist
	'("copy-webtools-files"
	 :base-directory "~/Dropbox/orgshared/sites/org/earlab/tools/webtools/"
	 :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|zip"
	 :publishing-directory "~/Dropbox/orgshared/sites/html/earlab/tools/webtools/"
	 :recursive t
	 :publishing-function org-publish-attachment
	 )

       )
</pre>

<p>
To define the same project using DynSite one writes the following text in the config.org file which is contained in the folder that holds the org files of he project: 
</p>

<pre class="example">
* section-numbers: nil
* table-of-contents: nil
* recursive: t
* headline-levels: 1
* auto-preamble: t
* preamble
&lt;div id="toc"&gt;
&lt;a href="http://earlab.org/"&gt;Earlab Home&lt;/a&gt; | 
&lt;a href="http://earlab.org/tools/webtools"&gt;Web Tools Home&lt;/a&gt; | 
&lt;a href="http://earlab.org/tools/webtools/gettingstart.html"&gt;Getting Started&lt;/a&gt; | 
&lt;a href="http://earlab.org/tools/webtools/javascript.html"&gt;JavaScript&lt;/a&gt; | 
&lt;a href="http://earlab.org/tools/webtools/projects.html"&gt;Projects&lt;/a&gt; | 
&lt;a href="http://earlab.org/tools/webtools/tutorials.html"&gt;Tutorials&lt;/a&gt; | 
&lt;a href="http://earlab.org/tools/webtools/topics.html"&gt;Topics&lt;/a&gt; | 
&lt;a href="http://earlab.org/tools/webtools/links.html"&gt;Links&lt;/a&gt; | 
&lt;/div&gt;
* style
&lt;link rel="stylesheet" href="./css/org.css" type="text/css"/&gt;
* auto-index: t
* table-of-contents: t
* author: "Ioannis Zannos &amp; Aris Bezas"
* email:  "zannos AT gmail DOT com  &amp; aribezas AT gmail DOT com"
</pre>

<p>
Note that the definition of the project is much shorter in config.org, because many items are automatically provided by DynSite based on the location and name of the folder which contains the project: 
</p>
<ul class="org-ul">
<li>The name of the project is provided by the name of the folder that contains the config.org and the org content files.
</li>
<li>The base directory is inferred automatically.
</li>
<li>The publishing directory is inferred automatically.
</li>
<li>The publishing function is provided automatically
</li>
<li>The project for publishing configuration and media files (css, png, mp3, etc) is created automatically
</li>
</ul>

<p>
You can add a site to the list of sites as follows (but this will not make it current):
</p>
<div class="example:">
<p>
(add-to-list 'org-sites org-current-site '(&lt;site name&gt; &lt;org path&gt; &lt;html path&gt; &lt;upload url&gt;))
</p>

</div>

<p>
Example: 
</p>
<div class="example:">
<p>
(add-to-list 'org-sites
      '(
    "larigot-earlab" 
    "~/Dropbox/orgshared/sites/org/larigot-tests" 
    "~/Dropbox/orgshared/sites/html/larigot-tests" 
    "earlabor@earlab.org:public_html/larigot-tests/"))
</p>

</div>

<p>
To add a site and make it current use the function org-install-site as described in the next section. 
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">The Project List</h2>
