dynsite-org/dynsite-help.org
** Project inheritance

If a project folder /a/ contains a folder /b/ that defines another project, then the project defined in folder /b/ inherits the properties of project /a/. The property values set in /b/ overwrite any properties with the same name set by /a/. /b/ is called a subproject of /a/, and /a/ is called a superproject of /b/.

The name of each project is generated from the name of the folder that contains it, and the names of its superprojects, separated by "<". For example, if we have two projects contained in folders like this: 

./mainproject
./mainproject/subproject

then the project contained in folder ./mainproject/subproject will be called subproject<mainproject. 

** Org and static projects

For each folder that contains a config.org file, DynSite generates three projects: 

1. A project for the org files of the site only. This contains the org files which will be translated to html. 
2. A "static" project containing non-org files of the site (css, jpeg, mp3, pdf or other files). These files are simply copied over to the target folder as-is, without any translation. 
3. A project including both the org-files and the non-org files. 

The non-org file projects are named by appending "-static" to the name of the org project. 
The projects containing both the org and the non-org files are named by appending "-all" to the name of the org project. 

Additionally there are generated 3 project groups: "all", "all-all", and "all-static" that contain all org, static and combined org/static projects of a site.  The projects are named after the folder that contains them plus the list of superfolders, so as to be immediately identifiable. For example, the projects of the site defined in folder =dynsite-org= in the present documentation are: 

- "all-all" :: All projects of the website.
- "dynsite-org-all" :: All projects of the dynsite project (= top project).
- "dynsite-org" :: The org files of the dynsite project, that is,
                   the org files, which will be rendered in html.
- "dynsite-org-static" :: The static project of dynsite, that is, media and other 
     files which are not rendered but only copied. 
- "subproject<dynsite-org-all" :: All files of the project contained in folder =subproject=.
- "subproject<dynsite-org" :: Only the org files of the project =subproject=
- "subproject<dynsite-org-static" :: Only the static files of the project =subproject=

* Installing a Site

Run this to install your own site in the list of sites and make it the current site to work on: 
#+BEGIN_EXAMPLE:
(org-install-site <site definition list>)
#+END_EXAMPLE:

Example: 

#+BEGIN_EXAMPLE
(org-install-site 
     '(
;; name of your site: 
	"larigot-earlab" 
;; path of the folder containing the all org project files:
	"~/Dropbox/orgshared/sites/org/larigot-tests" 
 ;; path of the folder where the html files will be published:
	"~/Dropbox/orgshared/sites/html/larigot-tests" 
 ;; this string will be used as address to upload files to web with rsync:
	"earlabor@earlab.org:public_html/larigot-tests/"
))
#+END_EXAMPLE

* Publish+Upload a Site

(meta-x:) org-republish-and-upload-site

This command is bound to the keyboard shortcut *super-meta-control-shift-p* (where "super" is the cmd key on the mac or the windows key on windows, and meta is opt or alt or escape depending on your keyboard and emacs setup). 

This is the most basic command for publishing a site. It generates all the projects of the site from the config.org files, publishes the projects, then opens a shell window and types the rsync command for uploading the site. 

* Working with multiple sites

** Adding a site

The list of known org-publish websites is stored in variable =org-sites=. This is a list of the form: 

=((name org-site-root org-site-html org-site-url) (name org-site-root ...) ...)= (see above at [[Installing a Site]]

Each element of the list has the form (name org-site-root org-site-html org-site-url), where: 

- =name= is the name of the site
- =org-site-root= is the path of the root folder containing the org files
- =org-site-html= is the path of the root folder which will hold the exported html files. If it is nil, it is deduced from org-site-root by adding a folder "html" inside the folder org-site-root. 
- =org-site-url= is the root url of the site, used to upload the site files with rsync

The default value of the =org-sites= list is: 

(("default" "~/org" nil "earlabor@earlab.org:~/public_html/org/"))

This means that there is only one default site, named "default".

To add a new site definition to the list of known sites without making it current use the function =add-to-list=. Example: 

(add-to-list 'org-sites '("site2" "~/site2" "~/site2_published" "tomjones@jones.com:~/public_html/"))

To add a site and make it current use the function =org-install-site= (see above [[Installing a Site]]) 

** Choosing one site to work with, from the list of known sites
1. Type: meta-x org-choose-site
2. Type the "tab" key to show all known sites

Choose a site by typing the initial names of its name and using the tab-key to autocomplete the rest of the name. Then type return to install the chosen site as current. 

* Generate projects

When adding a new project folder to a site, one must re-scan the folders of the site to add the new project to the list of projects of the site. The function =org-build-projects= scans the contents of the site folder for config.org files and builds all projects from their contents:

meta-x org-build-projects

This is bound to key: control-super-shift-b

* Publish selected project

When a site is large, it may be time consuming to publish all projects each time that some file in one project has changed. To publish a single project from a site use function org-publish-filtering-subprojects:

meta-x org-publish-filtering-subprojects

This will let you choose a project interactively from the list of projects defined by the current site.

This function is bound to key super-B, that is: Command-key (cmd or windows icon) + shift key + b. 

* Utilities

** Add project files to refile targets

meta-x org-publish-add-all-files-to-refile-targets

This adds all 1st and 2nd level sections of all files of all projects to refile targets, making them interactively accessible through a list by org-capture-goto-target (control-u control-c control-w).

** Force export of all files 

meta-x org-reset-all-project-files

** Dired site directory

meta-x org-dired-site

