dynsite-help.html
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">Project inheritance</h3>
<div class="outline-text-3" id="text-6-1">
<p>
If a project folder <i>a</i> contains a folder <i>b</i> that defines another project, then the project defined in folder <i>b</i> inherits the properties of project <i>a</i>. The property values set in <i>b</i> overwrite any properties with the same name set by <i>a</i>. <i>b</i> is called a subproject of <i>a</i>, and <i>a</i> is called a superproject of <i>b</i>.
</p>

<p>
The name of each project is generated from the name of the folder that contains it, and the names of its superprojects, separated by "&lt;". For example, if we have two projects contained in folders like this: 
</p>

<p>
./mainproject
./mainproject/subproject
</p>

<p>
then the project contained in folder ./mainproject/subproject will be called subproject&lt;mainproject. 
</p>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2">Org and static projects</h3>
<div class="outline-text-3" id="text-6-2">
<p>
For each folder that contains a config.org file, DynSite generates three projects: 
</p>

<ol class="org-ol">
<li>A project for the org files of the site only. This contains the org files which will be translated to html. 
</li>
<li>A "static" project containing non-org files of the site (css, jpeg, mp3, pdf or other files). These files are simply copied over to the target folder as-is, without any translation. 
</li>
<li>A project including both the org-files and the non-org files. 
</li>
</ol>

<p>
The non-org file projects are named by appending "-static" to the name of the org project. 
The projects containing both the org and the non-org files are named by appending "-all" to the name of the org project. 
</p>

<p>
Additionally there are generated 3 project groups: "all", "all-all", and "all-static" that contain all org, static and combined org/static projects of a site.  The projects are named after the folder that contains them plus the list of superfolders, so as to be immediately identifiable. For example, the projects of the site defined in folder <code>dynsite-org</code> in the present documentation are: 
</p>

<dl class="org-dl">
<dt> "all-all" </dt><dd>All projects of the website.
</dd>
<dt> "dynsite-org-all" </dt><dd>All projects of the dynsite project (= top project).
</dd>
<dt> "dynsite-org" </dt><dd>The org files of the dynsite project, that is,
the org files, which will be rendered in html.
</dd>
<dt> "dynsite-org-static" </dt><dd>The static project of dynsite, that is, media and other 
files which are not rendered but only copied. 
</dd>
<dt> "subproject&lt;dynsite-org-all" </dt><dd>All files of the project contained in folder <code>subproject</code>.
</dd>
<dt> "subproject&lt;dynsite-org" </dt><dd>Only the org files of the project <code>subproject</code>
</dd>
<dt> "subproject&lt;dynsite-org-static" </dt><dd>Only the static files of the project <code>subproject</code>
</dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Installing a Site</h2>
<div class="outline-text-2" id="text-7">
<p>
Run this to install your own site in the list of sites and make it the current site to work on: 
</p>
<div class="example:">
<p>
(org-install-site &lt;site definition list&gt;)
</p>

</div>

<p>
Example: 
</p>

<pre class="example">
(org-install-site 
     '(
;; name of your site: 
	"larigot-earlab" 
;; path of the folder containing the all org project files:
	"~/Dropbox/orgshared/sites/org/larigot-tests" 
 ;; path of the folder where the html files will be published:
	"~/Dropbox/orgshared/sites/html/larigot-tests" 
 ;; this string will be used as address to upload files to web with rsync:
	"earlabor@earlab.org:public_html/larigot-tests/"
))
</pre>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Publish+Upload a Site</h2>
<div class="outline-text-2" id="text-8">
<p>
(meta-x:) org-republish-and-upload-site
</p>

<p>
This command is bound to the keyboard shortcut <b>super-meta-control-shift-p</b> (where "super" is the cmd key on the mac or the windows key on windows, and meta is opt or alt or escape depending on your keyboard and emacs setup). 
</p>

<p>
This is the most basic command for publishing a site. It generates all the projects of the site from the config.org files, publishes the projects, then opens a shell window and types the rsync command for uploading the site. 
</p>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Working with multiple sites</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1">Adding a site</h3>
<div class="outline-text-3" id="text-9-1">
<p>
The list of known org-publish websites is stored in variable <code>org-sites</code>. This is a list of the form: 
</p>

<p>
<code>((name org-site-root org-site-html org-site-url) (name org-site-root ...) ...)</code> (see above at <a href="#sec-7">Installing a Site</a>
</p>

<p>
Each element of the list has the form (name org-site-root org-site-html org-site-url), where: 
</p>

<ul class="org-ul">
<li><code>name</code> is the name of the site
</li>
<li><code>org-site-root</code> is the path of the root folder containing the org files
</li>
<li><code>org-site-html</code> is the path of the root folder which will hold the exported html files. If it is nil, it is deduced from org-site-root by adding a folder "html" inside the folder org-site-root. 
</li>
<li><code>org-site-url</code> is the root url of the site, used to upload the site files with rsync
</li>
</ul>

<p>
The default value of the <code>org-sites</code> list is: 
</p>

<p>
(("default" "~/org" nil "earlabor@earlab.org:~/public_html/org/"))
</p>

<p>
This means that there is only one default site, named "default".
</p>

<p>
To add a new site definition to the list of known sites without making it current use the function <code>add-to-list</code>. Example: 
</p>

<p>
(add-to-list 'org-sites '("site2" "~/site2" "~/site2_published" "tomjones@jones.com:~/public_html/"))
</p>

<p>
To add a site and make it current use the function <code>org-install-site</code> (see above <a href="#sec-7">Installing a Site</a>) 
</p>
</div>
</div>
<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2">Choosing one site to work with, from the list of known sites</h3>
<div class="outline-text-3" id="text-9-2">
<ol class="org-ol">
<li>Type: meta-x org-choose-site
</li>
<li>Type the "tab" key to show all known sites
</li>
</ol>

<p>
Choose a site by typing the initial names of its name and using the tab-key to autocomplete the rest of the name. Then type return to install the chosen site as current. 
</p>
</div>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Generate projects</h2>
<div class="outline-text-2" id="text-10">
<p>
When adding a new project folder to a site, one must re-scan the folders of the site to add the new project to the list of projects of the site. The function <code>org-build-projects</code> scans the contents of the site folder for config.org files and builds all projects from their contents:
</p>

<p>
meta-x org-build-projects
</p>

<p>
This is bound to key: control-super-shift-b
</p>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">Publish selected project</h2>
<div class="outline-text-2" id="text-11">
<p>
When a site is large, it may be time consuming to publish all projects each time that some file in one project has changed. To publish a single project from a site use function org-publish-filtering-subprojects:
</p>

<p>
meta-x org-publish-filtering-subprojects
</p>

<p>
This will let you choose a project interactively from the list of projects defined by the current site.
</p>

<p>
This function is bound to key super-B, that is: Command-key (cmd or windows icon) + shift key + b. 
</p>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">Utilities</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1">Add project files to refile targets</h3>
<div class="outline-text-3" id="text-12-1">
<p>
meta-x org-publish-add-all-files-to-refile-targets
</p>

<p>
This adds all 1st and 2nd level sections of all files of all projects to refile targets, making them interactively accessible through a list by org-capture-goto-target (control-u control-c control-w).
</p>
</div>
</div>
<div id="outline-container-sec-12-2" class="outline-3">
<h3 id="sec-12-2">Force export of all files</h3>
<div class="outline-text-3" id="text-12-2">
<p>
meta-x org-reset-all-project-files
</p>
</div>
</div>
<div id="outline-container-sec-12-3" class="outline-3">
<h3 id="sec-12-3">Dired site directory</h3>
<div class="outline-text-3" id="text-12-3">
<p>
meta-x org-dired-site
</p>
</div>
</div>
